In [1]:
import os
import numpy as np 
import pandas as pd 

from matplotlib import pyplot
from mpl_toolkits.mplot3d import Axes3D

## Extrayendo datos

In [4]:
# Cargar datos

data = pd.read_csv('datasets/test.csv',delimiter=',')

print(data['RERA'])
dic = dict(data)

new_data=pd.DataFrame(dic,columns=['UNDER_CONSTRUCTION','RERA', 'BHK_NO.', 'SQUARE_FT','ADDRESS'])
new_data = new_data[:100]

new_data = new_data.rename(columns={'UNDER_CONSTRUCTION':'En Contruccion'})
new_data = new_data.rename(columns={'RERA':'DDRR'})
new_data = new_data.rename(columns={'BHK_NO.':'# Cuartos'})
new_data = new_data.rename(columns={'ADDRESS':'Calle'})
new_data = new_data.rename(columns={'SQUARE_FT':'Area'})
#print(new_data)

0        0
1        1
2        0
3        0
4        0
        ..
68715    1
68716    1
68717    1
68718    0
68719    0
Name: RERA, Length: 68720, dtype: int64

In [5]:
dic = dict(new_data)
print(dic)

{'En Contruccion': 0     0
1     1
2     0
3     0
4     0
     ..
95    0
96    0
97    0
98    0
99    0
Name: En Contruccion, Length: 100, dtype: int64, 'DDRR': 0     0
1     1
2     0
3     0
4     0
     ..
95    1
96    0
97    0
98    1
99    0
Name: DDRR, Length: 100, dtype: int64, '# Cuartos': 0      1
1      2
2      2
3      3
4      1
      ..
95     2
96     2
97    10
98     2
99     2
Name: # Cuartos, Length: 100, dtype: int64, 'Area': 0      545.171340
1      800.000000
2     1257.096513
3     1400.329489
4      430.477830
         ...
95    1120.238984
96     890.000000
97    2481.016465
98    1027.066216
99     810.170759
Name: Area, Length: 100, dtype: float64, 'Calle': 0                      Kamrej,Surat
1                   Panvel,Lalitpur
2                  New Town,Kolkata
3                Kalwar Road,Jaipur
4                 Mai Mandir,Nadiad
                  ...
95    Sector 80 Faridabad,Faridabad
96              Champasari,Siliguri
97          Kaggadasapura,Bangalore
98                   Hinjewadi,Pune
99     Kandivali (East),Maharashtra
Name: Calle, Length: 100, dtype: object}

In [2]:
data = pd.read_csv('datasets/all_casa.csv',delimiter=',')
data[:5]

,ADDRESS,SUBURB,PRICE,BEDROOMS,BATHROOMS,GARAGE,LAND_AREA,FLOOR_AREA,BUILD_YEAR,CBD_DIST,NEAREST_STN,NEAREST_STN_DIST,DATE_SOLD,POSTCODE,LATITUDE,LONGITUDE,NEAREST_SCH,NEAREST_SCH_DIST,NEAREST_SCH_RANK
0,1 Acorn Place,South Lake,565000,4,2,2.0,600,160,2003.0,18300,Cockburn Central Station,1800,09-2018\r,6164,-32.115900,115.842450,LAKELAND SENIOR HIGH SCHOOL,0.828339,NaN
1,1 Addis Way,Wandi,365000,3,2,2.0,351,139,2013.0,26900,Kwinana Station,4900,02-2019\r,6167,-32.193470,115.859554,ATWELL COLLEGE,5.524324,129.0
2,1 Ainsley Court,Camillo,287000,3,1,1.0,719,86,1979.0,22600,Challis Station,1900,06-2015\r,6111,-32.120578,115.993579,KELMSCOTT SENIOR HIGH SCHOOL,1.649178,113.0
3,1 Albert Street,Bellevue,255000,2,1,2.0,651,59,1953.0,17900,Midland Station,3600,07-2018\r,6056,-31.900547,116.038009,SWAN VIEW SENIOR HIGH SCHOOL,1.571401,NaN
4,1 Aman Place,Lockridge,325000,4,1,2.0,466,131,1998.0,11200,Bassendean Station,2000,11-2016\r,6054,-31.885790,115.947780,KIARA COLLEGE,1.514922,NaN

In [3]:
data = pd.read_csv('datasets/all_casa.csv',delimiter=',')
dic  = dict(data)
#print(data)

data = pd.DataFrame(dic, columns=['BEDROOMS', 'BATHROOMS', 'GARAGE', 'LAND_AREA', 'FLOOR_AREA', 'BUILD_YEAR', 'CBD_DIST', 'NEAREST_SCH_DIST','LATITUDE', 'LONGITUDE','PRICE','ADDRESS', 'DATE_SOLD'])
data = data[:120]

data = data.rename(columns={'ADDRESS':'Direccion'})
data = data.rename(columns={'PRICE':'Precio'})
data = data.rename(columns={'BEDROOMS':'Cuartos'})
data = data.rename(columns={'BATHROOMS':'Baños'})
data = data.rename(columns={'LAND_AREA':'Area'})

data = data.rename(columns={'FLOOR_AREA':'Construido'})
data = data.rename(columns={'BUILD_YEAR':'Año'})
data = data.rename(columns={'CBD_DIST':'Dis_Cento'})
data = data.rename(columns={'DATE_SOLD':'Ult_venta'})
data = data.rename(columns={'NEAREST_SCH_DIST':'Dis_Escuela'})
data = pd.DataFrame(data)

#print(data[:5])

data.reset_index().to_csv('Data_Casas.csv', header=True, index=False)

In [7]:
data = pd.read_csv('datasets/Data_Casas.csv')

d = pd.DataFrame(data)
print(d)

     index  Cuartos  Baños  GARAGE  Area m2  Construido     Año  Dis_Cento  \
0        0        4      2     2.0      600         160  2003.0      18300
1        1        3      2     2.0      351         139  2013.0      26900
2        2        3      1     1.0      719          86  1979.0      22600
3        3        2      1     2.0      651          59  1953.0      17900
4        4        4      1     2.0      466         131  1998.0      11200
..     ...      ...    ...     ...      ...         ...     ...        ...
115    115        2      1     2.0     1100         497  1958.0       9300
116    116        4      2     4.0      580         140  2006.0      42900
117    117        4      2     2.0      694         246  2010.0      32600
118    118        3      2     2.0      327         171  2008.0      15900
119    119        4      2     1.0      450         150  2002.0      12600

     Dis_Escuela   Precio          Direccion  Ult_venta
0       0.828339   565000      1 Acorn Place  09-2018\r
1       5.524324   365000        1 Addis Way  02-2019\r
2       1.649178   287000    1 Ainsley Court  06-2015\r
3       1.571401   255000    1 Albert Street  07-2018\r
4       1.514922   325000       1 Aman Place  11-2016\r
..           ...      ...                ...        ...
115     1.335489  2200000  1 Curruthers Road  12-2018\r
116     1.362245   375000     1 Cypress Mews  09-2018\r
117     0.923652   495000   1 Dagostino Road  11-2020\r
118     0.308294   445000       1 Dalkey Way  09-2016\r
119     1.000877   515000    1 Danzil Street  07-2019\r

[120 rows x 12 columns]